import { Button } from "antd";
import Link from "next/link";
import React from "react";

const JavaScriptHome = () => {
  return (
    <section className="">
      <div className="container-center">
        <div>
          <h1 className="mb-4 text-4xl font-bold">জাভাস্ক্রিপ্ট কি?</h1>
          <p className="mb-8 text-xl">
            জাভাস্ক্রিপ্ট একটি হাই-লেভেল, ডাইনামিক, অবজেক্ট-অরিয়েন্টেড
            প্রোগ্রামিং ভাষা। এটি সাধারনত ওয়েব ডেভেলপমেন্টে ব্যবহার করা হয় তবে
            বর্তমানে জাভাস্ক্রিপ্ট শুধু ওয়েব ডেভেলপমেন্টের মধ্যে সীমাবদ্ধ নয় ।
            এটি দিয়ে মোবাইল অ্যাপ্লিকেশন ডেভেলপমেন্ট, মেশিন লার্নিং, ডেস্কটপ
            এপ্লিকেশন ডেভেলপমেন্ট ইত্যাদি আরও বিভিন্ন কাজও করা যায় ।
          </p>
          <h2 className="mb-4 text-3xl font-bold">জাভাস্ক্রিপ্ট এর সুবিধা</h2>
          <ul className="mb-8 ml-8 list-disc">
            <li>
              জাভাস্ক্রিপ্ট একটি ক্লায়েন্ট-সাইড স্ক্রিপ্টিং ভাষা যা ব্রাউজারে
              চলে
            </li>
            <li>জাভাস্ক্রিপ্ট শেখা অপেক্ষাকৃত সহজ</li>
            <li>জাভা স্ক্রিপ্ট একটি ডায়নামিক প্রোগ্রামিং ল্যাঙ্গুয়েজ</li>
            <li>প্রোটোটাইপ-ভিত্তিক অবজেক্ট-ওরিয়েন্টেড প্রোগ্রামিং </li>
          </ul>
        </div>

        <div className="space-y-3">
          <h3 className="text-xl font-semibold italic">
            ২০২৫ সালে জাভাস্ক্রিপ্ট পৃথিবীর সবচেয়ে জনপ্রিয় প্রোগ্রামিং
            ল্যাঙ্গুয়েজ ।
          </h3>
          <h3 className="text-xl">
            জাভাস্ক্রিপ্ট এবং জাভা দুটি ভিন্ন প্রোগ্রামিং ল্যাঙ্গুয়েজ ।
          </h3>
          <h3 className="text-xl">
            জাভাস্ক্রিপ্ট ১৯৯৫ সালে তৈরি করা হয়েছিল, শোনা যায় জাভাস্ক্রিপ্ট
            প্রোগ্রামিং ল্যাঙ্গুয়েজ টি নাকি প্রথমে মাত্র ৭ দিনে তৈরি করা ।
            হয়েছিল
          </h3>
        </div>

        <div className="mt-8">
          <h2 className="mb-4 text-3xl font-bold">পূর্ব শর্ত </h2>
          <p className="text-xl">
            আমাদের এখান থেকে জাভাস্ক্রিপ্ট শেখার জন্য আপনার কোন পূর্ব অভিজ্ঞতা
            প্রয়োজন নেই । শুধু শেখার আগ্রহ থাকলেই আমাদের এখান থেকে আপনি
            জাভাস্ক্রিপ্ট শিখতে পারবেন ।
          </p>
        </div>

        <div className="mt-8">
          <h2 className="mb-4 text-3xl font-bold">কেন জাভাস্ক্রিপ্ট শিখব?</h2>
          <p className="text-xl">
            আপনার যদি প্রোগ্রামিং শেখার ইচ্ছা থাকে তাহলে জাভাস্ক্রিপ্ট দিয়ে
            শুরু করতে পারেন । আপনি যদি ওয়েব ডেভেলপমেন্ট কে ক্যারিয়ার হিসেবে
            নিতে চান তাহলেও জাভাস্ক্রিপ্ট শিখতে পারেন । আপনার যদি ইতিমধ্যে
            এইচটিএমএল এবং সিএসএস সম্পর্কে ধারণা থেকে থাকে তাহলে ওয়েব এপ্লিকেশনে
            ফাংশনালিটি আনতে জাভাস্ক্রিপ্ট শিখতে পারেন ।
          </p>
        </div>

        <div className="mt-7 flex justify-end">
          <Link href={`/javascript/intro-js`}>
            <Button type="primary" size="large" className="outline-none">
              Next →
            </Button>
          </Link>
        </div>
      </div>
    </section>
  );
};

export default JavaScriptHome;
